In [1]:
import pandas as pd
pd.__version__

'1.1.3'

In [4]:
df = pd.read_csv('F:\\Python ML DS\\weatherHistory.csv')
df

,Formatted Date,Summary,Precip Type,Temperature (C),Apparent Temperature (C),Humidity,Wind Speed (km/h),Wind Bearing (degrees),Visibility (km),Loud Cover,Pressure (millibars),Daily Summary
0,2006-04-01 00:00:00.000 +0200,Partly Cloudy,rain,9.472222,7.388889,0.89,14.1197,251.0,15.8263,0.0,1015.13,Partly cloudy throughout the day.
1,2006-04-01 01:00:00.000 +0200,Partly Cloudy,rain,9.355556,7.227778,0.86,14.2646,259.0,15.8263,0.0,1015.63,Partly cloudy throughout the day.
2,2006-04-01 02:00:00.000 +0200,Mostly Cloudy,rain,9.377778,9.377778,0.89,3.9284,204.0,14.9569,0.0,1015.94,Partly cloudy throughout the day.
3,2006-04-01 03:00:00.000 +0200,Partly Cloudy,rain,8.288889,5.944444,0.83,14.1036,269.0,15.8263,0.0,1016.41,Partly cloudy throughout the day.
4,2006-04-01 04:00:00.000 +0200,Mostly Cloudy,rain,8.755556,6.977778,0.83,11.0446,259.0,15.8263,0.0,1016.51,Partly cloudy throughout the day.
...,...,...,...,...,...,...,...,...,...,...,...,...
96448,2016-09-09 19:00:00.000 +0200,Partly Cloudy,rain,26.016667,26.016667,0.43,10.9963,31.0,16.1000,0.0,1014.36,Partly cloudy starting in the morning.
96449,2016-09-09 20:00:00.000 +0200,Partly Cloudy,rain,24.583333,24.583333,0.48,10.0947,20.0,15.5526,0.0,1015.16,Partly cloudy starting in the morning.
96450,2016-09-09 21:00:00.000 +0200,Partly Cloudy,rain,22.038889,22.038889,0.56,8.9838,30.0,16.1000,0.0,1015.66,Partly cloudy starting in the morning.
96451,2016-09-09 22:00:00.000 +0200,Partly Cloudy,rain,21.522222,21.522222,0.60,10.5294,20.0,16.1000,0.0,1015.95,Partly cloudy starting in the morning.
96452,2016-09-09 23:00:00.000 +0200,Partly Cloudy,rain,20.438889,20.438889,0.61,5.8765,39.0,15.5204,0.0,1016.16,Partly cloudy starting in the morning.

In [13]:
# Find the maximum temperature in the city
df["Temperature (C)"]

0         9.472222
1         9.355556
2         9.377778
3         8.288889
4         8.755556
           ...
96448    26.016667
96449    24.583333
96450    22.038889
96451    21.522222
96452    20.438889
Name: Temperature (C), Length: 96453, dtype: float64

In [14]:
df["Temperature (C)"].max()

39.90555555555555

In [18]:
"{:.2f}".format(df["Temperature (C)"].max())

'39.91'

In [19]:
float("{:.2f}".format(df["Temperature (C)"].max()))

39.91

In [28]:
#Bring all the dates when it was Mostly Cloudy with wind Bearing == 259
#Similar to if conditions -> head gives first 5, tail gives last 5

df["Formatted Date"][df['Summary'] == 'Mostly Cloudy'][df['Wind Bearing (degrees)'] == 259.0].head()

4       2006-04-01 04:00:00.000 +0200
1296    2006-08-31 00:00:00.000 +0200
1404    2006-08-07 12:00:00.000 +0200
1519    2006-12-11 07:00:00.000 +0100
5320    2006-03-18 16:00:00.000 +0100
Name: Formatted Date, dtype: object

In [29]:
# Find mean Humidity

df["Humidity"].mean()

0.7348989663358906

### Process of cleaning messy data is known as data munging or data wrangling

In [31]:
# Clean the data by writing 0 wherever NaN is found 

df.fillna(0, inplace=True)
df["Humidity"].mean()

0.7348989663358906

# Dataframe Basics

In [33]:
import pandas as pd
df = pd.read_excel("F:\\Python ML DS\\weather_mini.xlsx")
df

         day   temperature  Unnamed: 2  windspeed  event
0 2012-01-10            32         NaN          9   Rain
1 2015-01-11            35         NaN          2  Sunny
2 2014-01-12            12         NaN          5   Snow
3 2017-01-13            42         NaN          7   Snow
4 2018-01-14            26         NaN          4   Rain
5 2019-01-15            28         NaN          2  Sunny

In [34]:
# We can also use python dictionary inorder to create a dataframe

player_data = {
    "name": ["Cristiano", "Messi", "Lewandowski","Benzema","Pedri","Xavi"],
    "Goals":[1000,890,879,789,12,178],
    "Assists":[200,400,100,180,20,379],
    "Teams":["Manchester United", "PSG", "Bayern Munich","Real Madrid", "Bracelona", "Barcelona"]
}
newDf = pd.DataFrame(player_data)

In [35]:
newDf

          name  Goals  Assists              Teams
0    Cristiano   1000      200  Manchester United
1        Messi    890      400                PSG
2  Lewandowski    879      100      Bayern Munich
3      Benzema    789      180        Real Madrid
4        Pedri     12       20          Bracelona
5         Xavi    178      379          Barcelona

In [37]:
rows, columns = newDf.shape

In [38]:
rows

6

In [39]:
columns

4

In [40]:
newDf.head()

          name  Goals  Assists              Teams
0    Cristiano   1000      200  Manchester United
1        Messi    890      400                PSG
2  Lewandowski    879      100      Bayern Munich
3      Benzema    789      180        Real Madrid
4        Pedri     12       20          Bracelona

In [41]:
newDf.head(2)

        name  Goals  Assists              Teams
0  Cristiano   1000      200  Manchester United
1      Messi    890      400                PSG

In [43]:
newDf.tail()

          name  Goals  Assists          Teams
1        Messi    890      400            PSG
2  Lewandowski    879      100  Bayern Munich
3      Benzema    789      180    Real Madrid
4        Pedri     12       20      Bracelona
5         Xavi    178      379      Barcelona

In [44]:
newDf.tail(2)

    name  Goals  Assists      Teams
4  Pedri     12       20  Bracelona
5   Xavi    178      379  Barcelona

In [45]:
df[2:5]

         day   temperature  Unnamed: 2  windspeed event
2 2014-01-12            12         NaN          5  Snow
3 2017-01-13            42         NaN          7  Snow
4 2018-01-14            26         NaN          4  Rain

In [49]:
df.columns

Index(['day', ' temperature', 'Unnamed: 2', 'windspeed', 'event'], dtype='object')

In [50]:
for i in df.columns:
    print(i)

day
 temperature
Unnamed: 2
windspeed
event

In [51]:
df.day

0   2012-01-10
1   2015-01-11
2   2014-01-12
3   2017-01-13
4   2018-01-14
5   2019-01-15
Name: day, dtype: datetime64[ns]

In [52]:
newDf.columns

Index(['name', 'Goals', 'Assists', 'Teams'], dtype='object')

In [53]:
newDf['name']

0      Cristiano
1          Messi
2    Lewandowski
3        Benzema
4          Pedri
5           Xavi
Name: name, dtype: object

In [55]:
newDf.Goals

0    1000
1     890
2     879
3     789
4      12
5     178
Name: Goals, dtype: int64

In [56]:
type(newDf.Goals)

pandas.core.series.Series

In [58]:
# used to print few columns
newDf[["name","Goals","Teams"]]

          name  Goals              Teams
0    Cristiano   1000  Manchester United
1        Messi    890                PSG
2  Lewandowski    879      Bayern Munich
3      Benzema    789        Real Madrid
4        Pedri     12          Bracelona
5         Xavi    178          Barcelona

#### Common methods and properties

In [59]:
newDf

          name  Goals  Assists              Teams
0    Cristiano   1000      200  Manchester United
1        Messi    890      400                PSG
2  Lewandowski    879      100      Bayern Munich
3      Benzema    789      180        Real Madrid
4        Pedri     12       20          Bracelona
5         Xavi    178      379          Barcelona

In [60]:
newDf['Goals'].max()

1000

In [61]:
newDf['Assists']

0    200
1    400
2    100
3    180
4     20
5    379
Name: Assists, dtype: int64

In [62]:
newDf['Assists'].min()

20

In [71]:
# Find name of the player whose assists are minimum
min_assist = newDf["name"][newDf["Assists"] == newDf['Assists'].min()]
print('Player with minimum assist is {}'.format(min_assist))

Player with minimum assist is 4    Pedri
Name: name, dtype: object

In [72]:
newDf["Goals"].mean()

624.6666666666666

In [74]:
newDf["Goals"].std()

419.00819403284544

In [75]:
newDf.describe()

             Goals     Assists
count     6.000000    6.000000
mean    624.666667  213.166667
std     419.008194  150.864730
min      12.000000   20.000000
25%     330.750000  120.000000
50%     834.000000  190.000000
75%     887.250000  334.250000
max    1000.000000  400.000000

In [77]:
newDf[newDf["Assists"] > 200 ]

    name  Goals  Assists      Teams
1  Messi    890      400        PSG
5   Xavi    178      379  Barcelona

In [79]:
newDf[newDf.Assists == newDf["Assists"].max()]

    name  Goals  Assists Teams
1  Messi    890      400   PSG

In [91]:
newDf[["name","Assists"]][newDf.Assists == newDf["Assists"].max()]

    name  Assists
1  Messi      400

In [92]:
newDf.set_index('name',inplace=True)

In [93]:
newDf

             Goals  Assists              Teams
name
Cristiano     1000      200  Manchester United
Messi          890      400                PSG
Lewandowski    879      100      Bayern Munich
Benzema        789      180        Real Madrid
Pedri           12       20          Bracelona
Xavi           178      379          Barcelona

In [94]:
newDf.loc["Messi"]

Goals      890
Assists    400
Teams      PSG
Name: Messi, dtype: object

In [97]:
newDf.reset_index(inplace=True)

In [98]:
newDf

          name  Goals  Assists              Teams
0    Cristiano   1000      200  Manchester United
1        Messi    890      400                PSG
2  Lewandowski    879      100      Bayern Munich
3      Benzema    789      180        Real Madrid
4        Pedri     12       20          Bracelona
5         Xavi    178      379          Barcelona